export const nav = [
    {
        title: 'Главная',
        page: 'MainSection',
    },
    {
        title: 'Направления',
        page: 'DirectionsPage',
    },
    {
        title: 'Проекты студентов',
        page: 'ProjectsPage',
    },
    {
        title: 'Наша команда',
        page: 'TeamPage',
    },
    {
        title: 'Отзывы',
        page: 'ReviewsPage',
    }
]

export const directions = [
    {
        title: 'Python',
        age: 'с 10 лет',
        description: 'Программирование на Python. Доступным языком для детей.',
        img: 'python', 
    },
    {
        title: 'Roblox',
        age: 'с 8 лет',
        description: 'Ребенок будет создавать свои игры, а не просто играть в них!',
        img: 'roblox', 
    },
    {
        title: '3D моделирование',
        age: 'с 10 лет',
        description: 'Воплощаем самые смелые идеи в трехмерной форме.',
        img: '3D', 
    },
    {
        title: 'Scratch',
        age: 'с 7 лет',
        description: 'Создаем игры, используя визуальные блоки кода.',
        img: 'scratch', 
    },
    {
        title: 'Minecraft',
        age: 'с 10 лет',
        description: 'Научим вашего ребенка основам программирования на Python прямо в игре Minecraft',
        img: 'minecraft', 
    },
    {
        title: 'Компьютерная грамотность',
        age: 'с 7 лет',
        description: 'Знакомство с компьютером с азов — основных команд, программ и пользовательских навыков. Все это поможет ребенку быть с техникой на «ты», использовать ее грамотно и с пользой.',
        img: 'computer', 
    }
]

export const mainPageData = [
    {
        title: 'Творчество и созидание',
        direction: 'Ваш ребенок обожает игры? Мы поможем превратить это увлечение в полезный навык! Наша онлайн-школа предлагает курсы по созданию игр в Roblox и Minecraft, 3D-моделированию и Python. У нас он научится не просто играть, а творить собственные миры.',
        img: '1',
    },
    {
        title: 'Практика',
        direction: 'Мы учим через практику и игру. Наши педагоги — эксперты, которые умеют говорить с детьми на одном языке. Они помогут разобраться в сложных моментах и вдохновят на новые свершения. Никакой скучной теории — только живое общение и поддержка.',
        img: '2',
    },
    {
        title: 'Удобство',
        direction: 'Заниматься можно из любого места в удобное время. Онлайн-формат легко совместить с учебой в школе и другими кружками. Все уроки остаются в записи, чтобы можно было повторить материал в любой момент.',
        img: '3',
    },
    {
        title: 'Нацеленность на результат',
        direction: 'Ваш ребенок сразу видит результат: свою игру, 3D-модель или программу. Это лучшая мотивация двигаться дальше! К концу курса у него появится собственное портфолио.',
        img: '4',
    },
    {
        title: 'Актуальные знания',
        direction: 'Мы даем актуальные навыки для будущего. Умение программировать, моделировать и мыслить логически пригодится в любой профессии. Подарите ребенку возможность стать не просто пользователем, а создателем цифрового мира.',
        img: '5',
    }
]